In [2]:
import sys
import pandas as pd
import numpy as np

print('python version :' + sys.version)
print('pandas version :' + pd.__version__) # its version is hidden
print('numpy version :' + np.__version__) # its version is hidden

python version :3.6.6 |Anaconda custom (64-bit)| (default, Jun 28 2018, 11:27:44) [MSC v.1900 64 bit (AMD64)]
pandas version :0.23.4
numpy version :1.15.1

In [3]:
filename = r"C:\Users\anshs\00ANSH_PYTHON\04-10-18 [1] NUMPY\PANDAS\new_records.csv"

col_names="emp_id,name,location,age,home_at".split(',')
table = pd.read_csv(filename, header=1,names=col_names)
print(">>>", type(table), '\n>>>\n', table)

>>> <class 'pandas.core.frame.DataFrame'>
>>>
   emp_id               name   location  age    home_at
0  emp12        Naman Arora    Lucknow   18      Delhi
1  emp13         Vikas Jain     Bhopal   18    Gurgaon
2  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon
3  emp15        Priya Singh    Gurgaon   25      Delhi
4  cnt17  Rishab Srivastava     Mumbai   22      Noida
5  emp16      Pravita Singh     Kanpur   21      Delhi
6  tmp18        Naina Gupta    Sonipat   28  New Delhi
7  cnt19         Jai Tiwari  Hyderabad   24      Noida

In [4]:
table['name']='new_value' #will assign 'new_val' to every cell in column 'name'        
print(table)
print()
print()

# will add a new column , along with its values for each column   
table['gender']=list("MFFFMMMF") 
print(table)

  emp_id       name   location  age    home_at
0  emp12  new_value    Lucknow   18      Delhi
1  emp13  new_value     Bhopal   18    Gurgaon
2  emp14  new_value    Gurgaon   21    Gurgaon
3  emp15  new_value    Gurgaon   25      Delhi
4  cnt17  new_value     Mumbai   22      Noida
5  emp16  new_value     Kanpur   21      Delhi
6  tmp18  new_value    Sonipat   28  New Delhi
7  cnt19  new_value  Hyderabad   24      Noida


  emp_id       name   location  age    home_at gender
0  emp12  new_value    Lucknow   18      Delhi      M
1  emp13  new_value     Bhopal   18    Gurgaon      F
2  emp14  new_value    Gurgaon   21    Gurgaon      F
3  emp15  new_value    Gurgaon   25      Delhi      F
4  cnt17  new_value     Mumbai   22      Noida      M
5  emp16  new_value     Kanpur   21      Delhi      M
6  tmp18  new_value    Sonipat   28  New Delhi      M
7  cnt19  new_value  Hyderabad   24      Noida      F

In [5]:
del table['home_at']  # deletes all values of column 'home_at'
print(table)
a = \
    """
    del table[''] is dangerous to use. suppose del table['home_at']
    is used once and somehow print() doesn't work. then we run this 
    code again and now we will get an error saying "column does not exist
    
    a better way is to wrap it around some conditional function like:
        if table.does_column_exist(col_name):
            del table[col_name] 
            print(table)
    does any function like that exists??
    
    """

  emp_id       name   location  age gender
0  emp12  new_value    Lucknow   18      M
1  emp13  new_value     Bhopal   18      F
2  emp14  new_value    Gurgaon   21      F
3  emp15  new_value    Gurgaon   25      F
4  cnt17  new_value     Mumbai   22      M
5  emp16  new_value     Kanpur   21      M
6  tmp18  new_value    Sonipat   28      M
7  cnt19  new_value  Hyderabad   24      F

In [6]:
# how to remove rows???

table=table.drop(table.index[1])
print(table)
#it removes row from a copy of main table. therefore to make changes
#  in original table, you gotta assign it

  emp_id       name   location  age gender
0  emp12  new_value    Lucknow   18      M
2  emp14  new_value    Gurgaon   21      F
3  emp15  new_value    Gurgaon   25      F
4  cnt17  new_value     Mumbai   22      M
5  emp16  new_value     Kanpur   21      M
6  tmp18  new_value    Sonipat   28      M
7  cnt19  new_value  Hyderabad   24      F

In [36]:
# accessing each row:
table_length = len(table)
for i in range(table_length):
    print(">>>\n", type(table.loc[i]), table.loc[i])

#but i think this is wrong for 3 aspects:
#1) table.loc[:] is not defined anywhere
#2) we want data in  a list format, and not in column-value format (series format)
#3) since the indexes we are using are 0,1,2.. in this example, it does not mean ,
#  it will be always the same(remember that pandas is a 2-d datastructure whose both  indexname and column_name can be 
# changed and need not be 0,1,2...

>>>
 <class 'pandas.core.series.Series'> emp_id          emp12
name        new_value
location      Lucknow
age                18
gender              M
Name: 0, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          emp13
name        new_value
location       Bhopal
age                18
gender              F
Name: 1, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          emp14
name        new_value
location      Gurgaon
age                21
gender              F
Name: 2, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          emp15
name        new_value
location      Gurgaon
age                25
gender              F
Name: 3, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          cnt17
name        new_value
location       Mumbai
age                22
gender              M
Name: 4, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          emp16
name        new_value
location       Kanpur
age                21
gender              M
Name: 5, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          tmp18
name        new_value
location      Sonipat
age                28
gender              M
Name: 6, dtype: object
>>>
 <class 'pandas.core.series.Series'> emp_id          cnt19
name        new_value
location    Hyderabad
age                24
gender              F
Name: 7, dtype: object

In [7]:
#adding new row 

#table.loc[-1] = 'emp_-1', 'val_added', 'val_added', 0, 'G'
print(table)
a = \
    '''output(before executing the next statement)
    
        emp_id       name   location  age gender
     0   emp12  new_value    Lucknow   18      M
     1   emp13  new_value     Bhopal   18      F
     2   emp14  new_value    Gurgaon   21      F
     3   emp15  new_value    Gurgaon   25      F
     4   cnt17  new_value     Mumbai   22      M
     5   emp16  new_value     Kanpur   21      M
     6   tmp18  new_value    Sonipat   28      M
     7   cnt19  new_value  Hyderabad   24      F
    -1  emp_-1  val_added  val_added    0      G
    
    '''
#table.index+=1


'''output(before after the next statement)

    emp_id       name   location  age gender
1   emp12  new_value    Lucknow   18      M
2   emp13  new_value     Bhopal   18      F
3   emp14  new_value    Gurgaon   21      F
4   emp15  new_value    Gurgaon   25      F
5   cnt17  new_value     Mumbai   22      M
6   emp16  new_value     Kanpur   21      M
7   tmp18  new_value    Sonipat   28      M
8   cnt19  new_value  Hyderabad   24      F
0  emp_-1  val_added  val_added    0      G

'''

#BUT THIS IS CLEARLY WRONG! THE ORDER GOT DISRUPTED!
# but this guy solves it using the next line -_-
table = table.sort_index()

  emp_id       name   location  age gender
0  emp12  new_value    Lucknow   18      M
2  emp14  new_value    Gurgaon   21      F
3  emp15  new_value    Gurgaon   25      F
4  cnt17  new_value     Mumbai   22      M
5  emp16  new_value     Kanpur   21      M
6  tmp18  new_value    Sonipat   28      M
7  cnt19  new_value  Hyderabad   24      F

In [8]:
#modyfieng the current data,again it surely needs an if clause

table.loc[5] = 'hi'
table.loc[6] = 'this', 'will', 'change', 'full', 'row'
print(table)

  emp_id       name   location   age gender
0  emp12  new_value    Lucknow    18      M
2  emp14  new_value    Gurgaon    21      F
3  emp15  new_value    Gurgaon    25      F
4  cnt17  new_value     Mumbai    22      M
5     hi         hi         hi    hi     hi
6   this       will     change  full    row
7  cnt19  new_value  Hyderabad    24      F

In [69]:
print('>>>',table.__len__(),'\n',table)
table.index=list('abcdefg')
print('>>>\n',table)

>>> 7
    emp_id       name   location   age gender
1  emp_-1  val_added  val_added     0      G
2   emp14  new_value    Gurgaon    21      F
3   emp15  new_value    Gurgaon    25      F
4      hi         hi         hi    hi     hi
5    this       will     change  full    row
6   tmp18  new_value    Sonipat    28      M
7   cnt19  new_value  Hyderabad    24      F
>>>
    emp_id       name   location   age gender
a  emp_-1  val_added  val_added     0      G
b   emp14  new_value    Gurgaon    21      F
c   emp15  new_value    Gurgaon    25      F
d      hi         hi         hi    hi     hi
e    this       will     change  full    row
f   tmp18  new_value    Sonipat    28      M
g   cnt19  new_value  Hyderabad    24      F

In [70]:
table.reset_index()  #doesn't work, ideally it should revert to default index
print('>>>\n', table)

#but table.rset_index() works in this example::
a = \
    """
    suppose we have data like this :
    
     emp_id               name   location   age    home_at  spec_number
    0  emp11       Aakash Kumar      Patna   22      Noida         0.00
    1  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    2  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    3  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    4  emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    5  cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    6  emp16      Pravita Singh     Kanpur   21      Delhi         0.00
    7  tmp18        Naina Gupta    Sonipat   28  New Delhi         0.00
    8  cnt19         Jai Tiwari  Hyderabad   24      Noida        -2.25
    0  emp11       Aakash Kumar      Patna   22      Noida         0.00
    1  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    2  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    3  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    4  emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    5  cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    6  emp16      Pravita Singh     Kanpur   21      Delhi         0.00
    7  tmp18        Naina Gupta    Sonipat   28  New Delhi         0.00
    8  cnt19         Jai Tiwari  Hyderabad   24      Noida        -2.25
    0  emp11       Aakash Kumar      Patna   22      Noida         0.00
    1  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    2  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    3  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    4  emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    5  cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    6  emp16      Pravita Singh     Kanpur   21      Delhi         0.00
    7  tmp18        Naina Gupta    Sonipat   28  New Delhi         0.00
    8  cnt19         Jai Tiwari  Hyderabad   24      Noida        -2.25
    0  emp11       Aakash Kumar      Patna   22      Noida         0.00
    1  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    2  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    3  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    4  emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    5  cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    6  emp16      Pravita Singh     Kanpur   21      Delhi         0.00
    
    data.resetindex() will add current indexs as 0th column to your data 
    and replace it by new indeses. i.e,
    
         index emp_id            name   location    age    home_at   spec_number             
    0       0  emp11       Aakash Kumar      Patna   22      Noida         0.00
    1       1  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    2       2  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    3       3  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    4       4  emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    5       5  cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    6       6  emp16      Pravita Singh     Kanpur   21      Delhi         0.00
    7       7  tmp18        Naina Gupta    Sonipat   28  New Delhi         0.00
    8       8  cnt19         Jai Tiwari  Hyderabad   24      Noida        -2.25
    9       0  emp11       Aakash Kumar      Patna   22      Noida         0.00
    10      1  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    11      2  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    ...
    
    
    if we don't want that, we can simply write : 
    data=data.reset_index(drop=True)
    
       emp_id               name   location  age    home_at  spec_number
    0   emp11       Aakash Kumar      Patna   22      Noida         0.00
    1   emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    2   emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    3   emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    4   emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    5   cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    6   emp16      Pravita Singh     Kanpur   21      Delhi         0.00
    7   tmp18        Naina Gupta    Sonipat   28  New Delhi         0.00
    8   cnt19         Jai Tiwari  Hyderabad   24      Noida        -2.25
    9   emp11       Aakash Kumar      Patna   22      Noida         0.00
    10  emp12        Naman Arora    Lucknow   18      Delhi        -1.25
    11  emp13         Vikas Jain     Bhopal   18    Gurgaon         1.00
    12  emp14      Nirmal Mishra    Gurgaon   21    Gurgaon         2.00
    13  emp15        Priya Singh    Gurgaon   25      Delhi        -1.75
    14  cnt17  Rishab Srivastava     Mumbai   22      Noida         3.25
    """

>>>
    emp_id       name   location   age gender
a  emp_-1  val_added  val_added     0      G
b   emp14  new_value    Gurgaon    21      F
c   emp15  new_value    Gurgaon    25      F
d      hi         hi         hi    hi     hi
e    this       will     change  full    row
f   tmp18  new_value    Sonipat    28      M
g   cnt19  new_value  Hyderabad    24      F

In [1]:
table['koo']='aah'

NameError: name 'table' is not defined

In [78]:
print(table)

   emp_id       name   location   age gender     k  koo
a  emp_-1  val_added  val_added     0      G  meow  aah
b   emp14  new_value    Gurgaon    21      F  meow  aah
c   emp15  new_value    Gurgaon    25      F  meow  aah
d      hi         hi         hi    hi     hi  meow  aah
e    this       will     change  full    row  meow  aah
f   tmp18  new_value    Sonipat    28      M  meow  aah
g   cnt19  new_value  Hyderabad    24      F  meow  aah

In [79]:
del table['koo']
print(table)

   emp_id       name   location   age gender     k
a  emp_-1  val_added  val_added     0      G  meow
b   emp14  new_value    Gurgaon    21      F  meow
c   emp15  new_value    Gurgaon    25      F  meow
d      hi         hi         hi    hi     hi  meow
e    this       will     change  full    row  meow
f   tmp18  new_value    Sonipat    28      M  meow
g   cnt19  new_value  Hyderabad    24      F  meow

In [4]:
###################################################################33
#therefore finally:
filename = r'C:\Users\anshs\00ANSH_PYTHON\04-10-18 [1] NUMPY\PANDAS\cars.csv'

table = pd.read_csv(filename)
print(">>>", type(table), '\n>>>\n', table)

>>> <class 'pandas.core.frame.DataFrame'>
>>>
                                  Model   MPG  Cylinders  Displacement  \
0            chevrolet chevelle malibu  18.0          8         307.0
1                    buick skylark 320  15.0          8         350.0
2                   plymouth satellite  18.0          8         318.0
3                        amc rebel sst  16.0          8         304.0
4                          ford torino  17.0          8         302.0
5                     ford galaxie 500  15.0          8         429.0
6                     chevrolet impala  14.0          8         454.0
7                    plymouth fury iii  14.0          8         440.0
8                     pontiac catalina  14.0          8         455.0
9                   amc ambassador dpl  15.0          8         390.0
10                 dodge challenger se  15.0          8         383.0
11                  plymouth 'cuda 340  14.0          8         340.0
12               chevrolet monte carlo  15.0          8         400.0
13             buick estate wagon (sw)  14.0          8         455.0
14               toyota corona mark ii  24.0          4         113.0
15                     plymouth duster  22.0          6         198.0
16                          amc hornet  18.0          6         199.0
17                       ford maverick  21.0          6         200.0
18                        datsun pl510  27.0          4          97.0
19        volkswagen 1131 deluxe sedan  26.0          4          97.0
20                         peugeot 504  25.0          4         110.0
21                         audi 100 ls  24.0          4         107.0
22                            saab 99e  25.0          4         104.0
23                            bmw 2002  26.0          4         121.0
24                         amc gremlin  21.0          6         199.0
25                           ford f250  10.0          8         360.0
26                           chevy c20  10.0          8         307.0
27                          dodge d200  11.0          8         318.0
28                            hi 1200d   9.0          8         304.0
29                        datsun pl510  27.0          4          97.0
..                                 ...   ...        ...           ...
364           chevrolet cavalier wagon  27.0          4         112.0
365          chevrolet cavalier 2-door  34.0          4         112.0
366         pontiac j2000 se hatchback  31.0          4         112.0
367                     dodge aries se  29.0          4         135.0
368                    pontiac phoenix  27.0          4         151.0
369               ford fairmont futura  24.0          4         140.0
370                     amc concord dl  23.0          4         151.0
371                volkswagen rabbit l  36.0          4         105.0
372                 mazda glc custom l  37.0          4          91.0
373                   mazda glc custom  31.0          4          91.0
374             plymouth horizon miser  38.0          4         105.0
375                     mercury lynx l  36.0          4          98.0
376                   nissan stanza xe  36.0          4         120.0
377                       honda accord  36.0          4         107.0
378                     toyota corolla  34.0          4         108.0
379                        honda civic  38.0          4          91.0
380                 honda civic (auto)  32.0          4          91.0
381                      datsun 310 gx  38.0          4          91.0
382              buick century limited  25.0          6         181.0
383  oldsmobile cutlass ciera (diesel)  38.0          6         262.0
384         chrysler lebaron medallion  26.0          4         156.0
385                     ford granada l  22.0          6         232.0
386                   toyota celica gt  32.0          4         144.0
387                  dodge charger 2.2  36.0          4         135.0
388                   chevrolet camaro  27.0          4         151.0
389                    ford mustang gl  27.0          4         140.0
390                          vw pickup  44.0          4          97.0
391                      dodge rampage  32.0          4         135.0
392                        ford ranger  28.0          4         120.0
393                         chevy s-10  31.0          4         119.0

     Horsepower  Weight  Acceleration  Year  Origin
0         130.0    3504          12.0    70      US
1         165.0    3693          11.5    70      US
2         150.0    3436          11.0    70      US
3         150.0    3433          12.0    70      US
4         140.0    3449          10.5    70      US
5         198.0    4341          10.0    70      US
6         220.0    4354           9.0    70      US
7         215.0    4312           8.5    70      US
8         225.0    4425          10.0    70      US
9         190.0    3850           8.5    70      US
10        170.0    3563          10.0    70      US
11        160.0    3609           8.0    70      US
12        150.0    3761           9.5    70      US
13        225.0    3086          10.0    70      US
14         95.0    2372          15.0    70   Japan
15         95.0    2833          15.5    70      US
16         97.0    2774          15.5    70      US
17         85.0    2587          16.0    70      US
18         88.0    2130          14.5    70   Japan
19         46.0    1835          20.5    70  Europe
20         87.0    2672          17.5    70  Europe
21         90.0    2430          14.5    70  Europe
22         95.0    2375          17.5    70  Europe
23        113.0    2234          12.5    70  Europe
24         90.0    2648          15.0    70      US
25        215.0    4615          14.0    70      US
26        200.0    4376          15.0    70      US
27        210.0    4382          13.5    70      US
28        193.0    4732          18.5    70      US
29         88.0    2130          14.5    71   Japan
..          ...     ...           ...   ...     ...
364        88.0    2640          18.6    82      US
365        88.0    2395          18.0    82      US
366        85.0    2575          16.2    82      US
367        84.0    2525          16.0    82      US
368        90.0    2735          18.0    82      US
369        92.0    2865          16.4    82      US
370         NaN    3035          20.5    82      US
371        74.0    1980          15.3    82  Europe
372        68.0    2025          18.2    82   Japan
373        68.0    1970          17.6    82   Japan
374        63.0    2125          14.7    82      US
375        70.0    2125          17.3    82      US
376        88.0    2160          14.5    82   Japan
377        75.0    2205          14.5    82   Japan
378        70.0    2245          16.9    82   Japan
379        67.0    1965          15.0    82   Japan
380        67.0    1965          15.7    82   Japan
381        67.0    1995          16.2    82   Japan
382       110.0    2945          16.4    82      US
383        85.0    3015          17.0    82      US
384        92.0    2585          14.5    82      US
385       112.0    2835          14.7    82      US
386        96.0    2665          13.9    82   Japan
387        84.0    2370          13.0    82      US
388        90.0    2950          17.3    82      US
389        86.0    2790          15.6    82      US
390        52.0    2130          24.6    82  Europe
391        84.0    2295          11.6    82      US
392        79.0    2625          18.6    82      US
393        82.0    2720          19.4    82      US

[394 rows x 9 columns]

In [5]:
# Accessing a cell
value = table['Displacement'][2]
print('>>>\n', type(value), value)

# Accessing a row
value = table.loc[2]  # not print(table[:][2])
print('>>>\n', type(value), value)  # gives the data in Series Data structure

# Accessing a complete column
value = table['Displacement']
print('>>>\n', type(value), value)  # gives the data in Series Data structure

>>>
 <class 'numpy.float64'> 318.0
>>>
 <class 'pandas.core.series.Series'> Model           plymouth satellite
MPG                             18
Cylinders                        8
Displacement                   318
Horsepower                     150
Weight                        3436
Acceleration                    11
Year                            70
Origin                          US
Name: 2, dtype: object
>>>
 <class 'pandas.core.series.Series'> 0      307.0
1      350.0
2      318.0
3      304.0
4      302.0
5      429.0
6      454.0
7      440.0
8      455.0
9      390.0
10     383.0
11     340.0
12     400.0
13     455.0
14     113.0
15     198.0
16     199.0
17     200.0
18      97.0
19      97.0
20     110.0
21     107.0
22     104.0
23     121.0
24     199.0
25     360.0
26     307.0
27     318.0
28     304.0
29      97.0
       ...
364    112.0
365    112.0
366    112.0
367    135.0
368    151.0
369    140.0
370    151.0
371    105.0
372     91.0
373     91.0
374    105.0
375     98.0
376    120.0
377    107.0
378    108.0
379     91.0
380     91.0
381     91.0
382    181.0
383    262.0
384    156.0
385    232.0
386    144.0
387    135.0
388    151.0
389    140.0
390     97.0
391    135.0
392    120.0
393    119.0
Name: Displacement, Length: 394, dtype: float64